/*
  1. Основи об'єктів:
  
  - Призначення
  - Створення об'єктів
  - Формат зберігання даних
  - Додавання та зміна властивостей (різниця між . та [])
  - Shorthand запис властивостей
  - Отримання значень з об'єкту
  - Специфіка типу даних об'єкт - передача за посиланням
  - Перебір for...in
*/

/*
  2. Напиши скрипт, який для об'єкта user послідовно:
  
  - Додає поле mood зі значенням 'happy'
  - Замінює значення hobby на 'skydiving'
  - Замінює значення premium на false
  - Виводить вміст об'єкта user у форматі ключ: значення,
    для цього скористайся Object.keys()
*/

// const user = {
//   hobby: 'guitar',
//   premium: true,
//   occupation: 'software engineer',
// };

/*
  3. Метод Object.values()

  Є об'єкт, де зберігаються зарплати нашої команди. Напиши
  функцію getResult для підсумовування усіх зарплат.

  Функція повинна отримувати об'єкт з інформацію про зарплати та
  повертати загальну їх суму.

  Якщо об'єкт salaries порожній, результат має бути 0 
*/

// const salaries = {
//   Andrii: 3000,
//   Anna: 1200,
//   Sofiya: 2000,
// };

/*
  4. Масив об'єктів

  Напишіть функцію calcTotalPrice(stones, stoneName), яка приймає
  масив об'єктів та рядок з назвою каменю. 
  
  Функція рахує і повертає загальну вартість каміння з ім'ям stoneName
*/

// const stones = [
//   { name: 'Смарагд', price: 1300, quantity: 4 },
//   { name: 'Діамант', price: 2700, quantity: 3 },
//   { name: 'Сапфір', price: 400, quantity: 7 },
//   { name: 'Топаз', price: 500, quantity: 10 },
//   { name: 'Аквамарин', price: 200, quantity: 8 },
// ];

/*
  5. Методи об'єкта та робота з this
  
  Напиши скрипт управління особистим кабінетом інтернет-банку
  
  Є об'єкт account, в якому необхідно реалізувати методи для роботи
  з балансом та історією транзакцій
*/

// Типів транзакцій лише два:
// Можна покласти чи зняти гроші з балансу
const Transaction = {
  DEPOSIT: 'deposit',
  WITHDRAW: 'withdraw',
};

const account = {
  // Поточний баланс
  balance: 0,

  // Исторія транзакцій
  transactions: [],
};

// Методи які необхнідно реалізувати:

/*
  Метод createTransaction створює та повертає об'єкт транзакції.

  Кожна транзакція - об'єкт з полями id, amount, type

  Приймає суму та тип транзакції.
*/

/*
  Метод deposit, що відповідає за додавання суми до балансу

  Приймає суму транзакції

  Викликає createTransaction для створення об'єкта транзакції
  та занесення його в історію транзакцій
*/

/*
  Метод withdraw, що відповідає за зняття суми з балансу.

  Приймає суму транзакції

  Якщо сума зняття більша за поточний баланс, виводь повідомлення
  про те, що зняття такої суми не можливе - недостатньо коштів
    
  Викликає createTransaction для створення об'єкта транзакції
  та занесення його в історію транзакцій.
*/
